src_ext/Documents/УЗ_ПриходДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>УЗ_ПриходДенег</Name>
			<BasedOn>
				<xr:Item>Catalog.УЗ_ФизЛица</xr:Item>
				<xr:Item>Catalog.УЗ_Абонемент</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УЗ_СписанияСуммЗаУроки</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_Касса</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_ДвижениеДисконтныхКарт</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Абонемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтатьиДвиженияДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Родитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБонусов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ДисконтныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_ext/AccumulationRegisters/УЗ_Касса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>УЗ_Касса</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Плательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтатьиДвиженияДенег</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src_ext/AccumulationRegisters/УЗ_СписанияСуммЗаУроки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>УЗ_СписанияСуммЗаУроки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Часы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоУроков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЯвок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Педагог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Скидки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ГруппыОбучения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Явка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src_ext/AccumulationRegisters/УЗ_ДвижениеДисконтныхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>УЗ_ДвижениеДисконтныхКарт</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаБонусов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ДисконтныеКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_Настройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>УЗ_Настройки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьОкругление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребоватьОписаниеКНеоплаченнымУрокам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребоватьОписаниеКНеоплаченнымУрокамС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьОповещения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодОповещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОповещатьОЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/Enums/УЗ_ВидыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>УЗ_ВидыОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВнутренняяКасса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КассаУченики</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗарплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочийРасход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_ext/Catalogs/УЗ_Кассы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>УЗ_Кассы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Основная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src_ext/Documents/УЗ_ПриходДенег/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	//дата запрета проверяется подпиской УЗ_ДатаЗапретаПередЗаписью (модуль УЗ_ДатыЗапрета)

	//решение В7: приход — только «Касса ученики» (оплата ученика) или «Внутренняя касса» (прочее поступление);
	//расходные виды в приходе молча добавляли бы деньги в кассу под видом выплаты/расхода
	Если ВидОперации <> Перечисления.УЗ_ВидыОпераций.КассаУченики
		И ВидОперации <> Перечисления.УЗ_ВидыОпераций.ВнутренняяКасса Тогда
		СообщитьОбОшибке(СтрШаблон(НСтр("ru = 'Вид «%1» — для расхода денег. В приходе выберите «Касса ученики» (оплата ученика) или «Внутренняя касса» (прочее поступление).'"),
			ВидОперации), "ВидОперации", Отказ);
		Возврат;
	КонецЕсли;
	ПроверитьЗаполнениеПрихода(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	// регистр Касса
	Если ЗначениеЗаполнено(СуммаДокумента) Тогда
		Движения.УЗ_Касса.Записывать = Истина;
		Движение = Движения.УЗ_Касса.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период 	 		= Дата;
		Движение.Клиент 	 		= ФизЛицо;
		Движение.Сумма  	 		= СуммаДокумента;
		Движение.Касса 		 		= Касса;
		Движение.ПредметОбучения 	= ПредметОбучения;
		Движение.ВидОперации 		= ВидОперации;
		Движение.СтатьяЗатрат 		= СтатьяЗатрат;
		Движение.Организация 		= Организация;
		Движение.Абонемент 			= Абонемент;
	КонецЕсли;

	//В14: уменьшение прихода или перенос в другую кассу не уводит кассу в минус (деньги уже выданы расходами)
	Справочники.УЗ_Кассы.ПроверитьОстаткиКасс(ЭтотОбъект, Движения.УЗ_Касса, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Если ВидОперации = Перечисления.УЗ_ВидыОпераций.КассаУченики и ЗначениеЗаполнено(СуммаДокумента) Тогда
		// регистр СписанияСуммЗаУроки 
		Движения.УЗ_СписанияСуммЗаУроки.Записывать = Истина;
		Движение = Движения.УЗ_СписанияСуммЗаУроки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период 	 		= Дата;
		Движение.Клиент 	 		= ФизЛицо;
		Движение.Сумма  	 		= СуммаДокумента;
		Движение.Тариф		 		= Тариф;
		Движение.ПредметОбучения 	= ПредметОбучения;
		Движение.Организация 		= Организация;
		Движение.Абонемент 			= Абонемент;
	КонецЕсли; 	          	
	
	Если ЗначениеЗаполнено(СуммаБонусов) И Не ЗначениеЗаполнено(ДисконтнаяКарта) Тогда
		СообщитьОбОшибке("Оплата бонусами: не выбрана дисконтная карта", "ДисконтнаяКарта", Отказ);
	КонецЕсли;

	Если ЗначениеЗаполнено(ДисконтнаяКарта) и ЗначениеЗаполнено(СуммаБонусов) Тогда

		//В24: единые проверки карты (срок, «Не действует», сумма ≥ 0, остаток под исключительной блокировкой —
		//две оплаты не потратят одни бонусы) — та же функция, что в списании остатков
		ТекстОшибкиКарты = Документы.УЗ_ПриходДенег.ПроверитьСписаниеБонусов(ДисконтнаяКарта, Дата, СуммаБонусов, Ссылка);
		Если ЗначениеЗаполнено(ТекстОшибкиКарты) Тогда
			СообщитьОбОшибке(ТекстОшибкиКарты, "СуммаБонусов", Отказ);
		КонецЕсли;

		//СписаниеБонусов
		Если ЗначениеЗаполнено(СуммаБонусов) Тогда
			Движения.УЗ_ДвижениеДисконтныхКарт.Записывать = Истина;
			Движение = Движения.УЗ_ДвижениеДисконтныхКарт.Добавить();
			Движение.ВидДвижения 		= ВидДвиженияНакопления.Расход;
			Движение.Период 	 		= Дата;
			Движение.Клиент 	 		= ДисконтнаяКарта.Владелец;
			Движение.ДисконтнаяКарта 	= ДисконтнаяКарта;
			Движение.СуммаБонусов		= СуммаБонусов;
			Движение.Организация 		= Организация;
		КонецЕсли;
		
		// регистр СписанияСуммЗаУроки ОплачиваемБонусами
		Если ЗначениеЗаполнено(СуммаБонусов) Тогда
			Движения.УЗ_СписанияСуммЗаУроки.Записывать = Истина;
			Движение = Движения.УЗ_СписанияСуммЗаУроки.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период 	 		= Дата;
			Движение.Клиент 	 		= ФизЛицо;
			Движение.Сумма  	 		= СуммаБонусов;
			Движение.Тариф		 		= Тариф;
			Движение.ПредметОбучения 	= ПредметОбучения;
			Движение.Организация 		= Организация;
			Движение.Абонемент 			= Абонемент;
		КонецЕсли;

	КонецЕсли;     	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	    	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.АвторДокумента) Тогда
		ЭтотОбъект.АвторДокумента = УЗ_Среда.ТекущийПользователь();
	КонецЕсли;

	//В12: касса и деньги ученика — по организации; документ, созданный программно без организации, — в организации
	//по умолчанию (как перемещение, C03), иначе его деньги легли бы в «пустую» организацию
	Если НЕ ЗначениеЗаполнено(Организация) И НЕ ОбменДанными.Загрузка Тогда
		Организация = РегистрыСведений.УЗ_Настройки.Настройки().Организация;
	КонецЕсли;

	//В14: отмена проведения (и пометка удаления) прихода не уводит кассу в минус — эти деньги уже могли выдать
	Справочники.УЗ_Кассы.ПередЗаписьюДокументаКассы(ЭтотОбъект, РежимЗаписи, Отказ);

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
		
	Если ЭтоНовый() Тогда
		LMНастроки = РегистрыСведений.УЗ_Настройки.Настройки();
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, LMНастроки);
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.УЗ_Урок") Тогда
		//ДокументОснования = ДанныеЗаполнения.Ссылка;
		//ВидОперации		  = Перечисления.УЗ_ВидыОпераций.КассаУченики;
		//Организация 	  = ДанныеЗаполнения.Организация;
		//ПредметОбучения	  = ДанныеЗаполнения.ПредметОбучения;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.УЗ_ФизЛица") Тогда
		
		ВидОперации	= Перечисления.УЗ_ВидыОпераций.КассаУченики;
		ФизЛицо	= ДанныеЗаполнения.Ссылка;
		ДокументОснования = ДанныеЗаполнения.Ссылка;
		
		Если ЗначениеЗаполнено(ДанныеЗаполнения.Ссылка.Родитель1) Тогда
			Родитель = ДанныеЗаполнения.Ссылка.Родитель1;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.УЗ_Абонемент") Тогда
		
		ВидОперации			= Перечисления.УЗ_ВидыОпераций.КассаУченики;
		ФизЛицо			= ДанныеЗаполнения.Ссылка.ФизЛицо;
		Абонемент			= ДанныеЗаполнения.Ссылка;
		ДокументОснования 	= ДанныеЗаполнения.Ссылка;
		ПредметОбучения 	= ДанныеЗаполнения.Ссылка.ПредметОбучения;
		СуммаДокумента	    = ДанныеЗаполнения.Ссылка.ЦенаАбонемента;
		
	КонецЕсли;	
		
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	АвторДокумента 	= Неопределено;
	Комментарий    	= Неопределено;
	Абонемент 		= Неопределено;
	ДисконтнаяКарта = Неопределено;
	ДокументОснования = Неопределено;
	
	Если Не ЗначениеЗаполнено(ОбъектКопирования.Организация) Тогда
		LMНастроки = РегистрыСведений.УЗ_Настройки.Настройки();
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, LMНастроки);
	КонецЕсли;
	
КонецПроцедуры

//Обязательное в приходе: сумма денег и бонусов ≥ 0 и хоть что-то принято; деньги — в указанную кассу своей
//организации (В12); оплата ученика — с учеником; бонусы (В24) — только оплата ученика: «Внутренняя касса» не
//зачисляет их ученику (прежде зачисляла — прочее поступление увеличивало баланс ученика мимо денег).
Процедура ПроверитьЗаполнениеПрихода(Отказ)

	Если СуммаДокумента < 0 Или СуммаБонусов < 0 Тогда
		СообщитьОбОшибке(НСтр("ru = 'Сумма и бонусы в приходе не могут быть отрицательными: возврат денег — расход денег «Касса ученики».'"),
			"СуммаДокумента", Отказ);
		Возврат;
	КонецЕсли;
	Если СуммаДокумента + СуммаБонусов = 0 Тогда
		СообщитьОбОшибке(НСтр("ru = 'Укажите сумму прихода (или бонусы в оплату).'"), "СуммаДокумента", Отказ);
	КонецЕсли;
	Если СуммаДокумента > 0 И НЕ ЗначениеЗаполнено(Касса) Тогда
		СообщитьОбОшибке(НСтр("ru = 'Укажите кассу, в которую поступают деньги.'"), "Касса", Отказ);
	КонецЕсли;
	ТекстКассы = Справочники.УЗ_Кассы.ТекстКассаДругойОрганизации(Касса, Организация);
	Если ЗначениеЗаполнено(ТекстКассы) Тогда
		СообщитьОбОшибке(ТекстКассы, "Касса", Отказ);
	КонецЕсли;
	Если ВидОперации = Перечисления.УЗ_ВидыОпераций.КассаУченики И НЕ ЗначениеЗаполнено(ФизЛицо) Тогда
		СообщитьОбОшибке(НСтр("ru = 'Оплата ученика — укажите ученика (физ. лицо).'"), "ФизЛицо", Отказ);
	КонецЕсли;
	Если ВидОперации = Перечисления.УЗ_ВидыОпераций.ВнутренняяКасса И СуммаБонусов > 0 Тогда
		СообщитьОбОшибке(НСтр("ru = 'Бонусы принимаются только в оплату ученика (вид «Касса ученики»): прочее поступление «Внутренняя касса» бонусы ученику не зачисляет.'"),
			"СуммаБонусов", Отказ);
	КонецЕсли;

КонецПроцедуры

Процедура СообщитьОбОшибке(Текст, Поле, Отказ)
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Текст;
	Сообщение.Поле = Поле;
	Сообщение.УстановитьДанные(ЭтотОбъект);
	Сообщение.Сообщить();
	Отказ = Истина;
	
КонецПроцедуры
